Revit 2027 API
MEPNetworkIterator(Document, MEPAnalyticalModelData, ConnectorDomainType) Constructor
 Creates an iterator by the analytical model data to visit all connected components in the network.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public MEPNetworkIterator(
	Document pADoc,
	MEPAnalyticalModelData seed,
	ConnectorDomainType eDomain
)
Public Sub New (
	pADoc As Document,
	seed As MEPAnalyticalModelData,
	eDomain As ConnectorDomainType
)
public:
MEPNetworkIterator(
	Document^ pADoc,
	MEPAnalyticalModelData^ seed,
	ConnectorDomainType eDomain
)
new :
        pADoc : Document *
        seed : MEPAnalyticalModelData *
        eDomain : ConnectorDomainType -> MEPNetworkIterator
Parameters
pADoc Document
 The document of the analytical network.
seed MEPAnalyticalModelData
 The analytical model data of the starting element.
eDomain ConnectorDomainType
 The domain of network that the iteration happens.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
MEPNetworkIterator Class
MEPNetworkIterator Overload
Autodesk.Revit.DB.Analysis Namespace